docs/lang/js.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="fh">

<link  href="../assets/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Dealing with Gaps</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Transpiler</h3>
<div class="outline-text-3" id="text-">
<p>
Convert newer language syntax like<br >
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #859900;">if</span> (something) {
    <span style="color: #859900;">let</span> <span style="color: #b58900;">x</span> = 3;
    console.log(x);
}
<span style="color: #859900;">else</span> {
    <span style="color: #859900;">let</span> <span style="color: #b58900;">x</span> = 4;
    console.log(x);
}
</pre>
</div>

<p>
to syntax that is compatible with older versions of the language (since JS is not forward compatible), like<br >
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #b58900;">x$0</span>, <span style="color: #b58900;">x$1</span>;
<span style="color: #859900;">if</span> (something) {
    x$0 = 3;
    console.log(x$0);
}
<span style="color: #859900;">else</span> {
    x$1 = 4;
    console.log(x$1);
}
</pre>
</div>

<p>
Popular choice for JS transpiler: <a href="https://babeljs.io/">babeljs.io</a>.<br >
</p>

<p>
(<i>Example from You Don't Know JS Yet (book series) - 2nd Edition, Kyle Simpson, <a href="https://github.com/getify/You-Dont-Know-JS">github.com</a>.</i>)<br >
</p>
</div>
</div>


<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Polyfill ("shim")</h3>
</div>
</div>



<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Pitfalls</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">negative indexing</h3>
<div class="outline-text-3" id="text-">
<p>
Doesn't exist! To properly index the last element<br >
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #b58900;">arr</span> = [1,2,3];
arr[arr.length - 1] = 5;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">comparison</h3>
<div class="outline-text-3" id="text-">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #6c71c4;">NaN</span> === <span style="color: #6c71c4;">NaN</span>;            <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
0 === -0;               <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">true</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js">[ 1, 2, 3 ] === [ 1, 2, 3 ];    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
{ a: 42 } === { a: 42 }         <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
(x =&gt; x * 2) === (x =&gt; x * 2)   <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #b58900;">x</span> = [ 1, 2, 3 ];

<span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">assignment is by reference-copy, so</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">y references the *same* array as x,</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">not another copy of it.</span>
<span style="color: #859900;">var</span> <span style="color: #b58900;">y</span> = x;

y === x;              <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">true</span>
y === [ 1, 2, 3 ];    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
x === [ 1, 2, 3 ];    <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
</pre>
</div>


<p>
I<br >
</p>
</div>

<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-"><code>&lt;</code> and <code>&gt;</code> perform coercion</h4>
<div class="outline-text-4" id="text-">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #b58900;">x</span> = <span style="color: #2aa198;">"10"</span>;
<span style="color: #859900;">var</span> <span style="color: #b58900;">y</span> = 9;

x &lt; y;      <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">false</span>
</pre>
</div>

<p>
but when they are of the same type, they use alphabetic<br >
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #b58900;">x</span> = <span style="color: #2aa198;">"10"</span>;
<span style="color: #859900;">var</span> <span style="color: #b58900;">y</span> = <span style="color: #2aa198;">"9"</span>;

x &lt; y;      <span style="color: #586e75; font-style: italic;">// </span><span style="color: #657b83; font-style: italic;">true, watch out!</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Test</h2>
<div class="outline-text-2" id="text-">
<p>
(test)<br >
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b58900;">x</span> = b
<span style="color: #859900;">print</span>(<span style="color: #2aa198;">"hello world"</span>)
</pre>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">Dealing with Gaps</a>
<ul class="nav">
<li><a href="#sec-">Transpiler</a></li>
<li><a href="#sec-">Polyfill ("shim")</a></li>
</ul>
</li>
<li><a href="#sec-">Pitfalls</a>
<ul class="nav">
<li><a href="#sec-">negative indexing</a></li>
<li><a href="#sec-">comparison</a></li>
</ul>
</li>
<li><a href="#sec-">Test</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
